export type CharSet = {
    id: string;
    name: string;
    matrix: (string | null)[][];
};

export const CHAR_SETS: CharSet[] = [
    {
        id: "basic-hira",
        name: "ひらがな基本 46 字",
        matrix: [
            ["あ", "い", "う", "え", "お"],
            ["か", "き", "く", "け", "こ"],
            ["さ", "し", "す", "せ", "そ"],
            ["た", "ち", "つ", "て", "と"],
            ["な", "に", "ぬ", "ね", "の"],
            ["は", "ひ", "ふ", "へ", "ほ"],
            ["ま", "み", "む", "め", "も"],
            ["や", null, "ゆ", null, "よ"],
            ["ら", "り", "る", "れ", "ろ"],
            ["わ", null, null, null, "を"],
            ["ん", null, null, null, null],
        ],
    },
    {
        id: "irh48-hira",
        name: "ひらがな（含清音・ゐ・ゑ）48 字（IRH48）",
        matrix: [
            ["あ", "い", "う", "え", "お"],
            ["か", "き", "く", "け", "こ"],
            ["さ", "し", "す", "せ", "そ"],
            ["た", "ち", "つ", "て", "と"],
            ["な", "に", "ぬ", "ね", "の"],
            ["は", "ひ", "ふ", "へ", "ほ"],
            ["ま", "み", "む", "め", "も"],
            ["や", null, "ゆ", null, "よ"],
            ["ら", "り", "る", "れ", "ろ"],
            ["わ", "ゐ", null, "ゑ", "を"],
            ["ん", null, null, null, null],
        ],
    },
    {
        id: "kiz48-hira",
        name: "ひらがな（含清音・促音・長音符）48 字（kiz48）",
        matrix: [
            ["あ", "い", "う", "え", "お"],
            ["か", "き", "く", "け", "こ"],
            ["さ", "し", "す", "せ", "そ"],
            ["た", "ち", "つ", "て", "と"],
            ["な", "に", "ぬ", "ね", "の"],
            ["は", "ひ", "ふ", "へ", "ほ"],
            ["ま", "み", "む", "め", "も"],
            ["や", null, "ゆ", null, "よ"],
            ["ら", "り", "る", "れ", "ろ"],
            ["わ", null, null, null, "を"],
            ["ん", null, "っ", null, "ー"],
        ],
    },
    {
        id: "full-hira",
        name: "ひらがな（フル）",
        matrix: [
            ["あ", "い", "う", "え", "お"],
            ["ぁ", "ぃ", "ぅ", "ぇ", "ぉ"],
            ["か", "き", "く", "け", "こ"],
            ["が", "ぎ", "ぐ", "げ", "ご"],
            ["さ", "し", "す", "せ", "そ"],
            ["ざ", "じ", "ず", "ぜ", "ぞ"],
            ["た", "ち", "つ", "て", "と"],
            ["だ", "ぢ", "づ", "で", "ど"],
            ["な", "に", "ぬ", "ね", "の"],
            ["は", "ひ", "ふ", "へ", "ほ"],
            ["ば", "び", "ぶ", "べ", "ぼ"],
            ["ぱ", "ぴ", "ぷ", "ぺ", "ぽ"],
            ["ま", "み", "む", "め", "も"],
            ["や", null, "ゆ", null, "よ"],
            ["ゃ", null, "ゅ", null, "ょ"],
            ["ら", "り", "る", "れ", "ろ"],
            ["わ", null, null, null, "を"],
            ["ん", null, "っ", null, "ー"],
        ],
    },
];

export const DEFAULT_CHAR_SET = CHAR_SETS[0];
